#+LATEX_CLASS_OPTIONS: [12pt, a4paper]
#+LATEX_HEADER: \input{exercise_header.tex}
#+PROPERTY: header-args :mkdirp yes
#+OPTIONS: toc:nil

*LABORATORY COURSE IN NUMERICAL METEOROLOGY*\\
*Exercise 1, Fri Jan 22 14:15-16:00 2016, E206*

** Github

Git and GitHub are great. Use them for your projects.

I use GitHub for all material which I write, and which I wish to keep
and/or share with others. GitHub takes care of version control,
backups, file sharing between the different computers I use, and
sharing and collaboration with others, all in one go.

The bash script and the makefile that we go through in this exercise,
as all the course material that I have written, is in GitHub
repository [[https://github.com/jlento/NumLab2016][jlento/NumLab2016]]. You can view the files directly using a
web browser, or get the whole repository to your current directory
in taito with all change history (large download) with

#+BEGIN_SRC bash :results output drawer :dir /tmp
module load git
git clone https://github.com/jlento/NumLab2016.git
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

